Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_SoftDryRunHandler(void)
{
    uint32_t now = now_ms();

    /***********************************************************
     * 1) COUNTDOWN MODE → Dry-run fully bypassed
     ***********************************************************/
    if (countdownActive)
    {
        dryState       = DRY_IDLE;
        dryConfirming  = false;
        dryDeadline    = 0;
        dryConfirmStart= 0;
        return;
    }

    /***********************************************************
     * 2) Normal dry-run check
     ***********************************************************/
    ModelHandle_CheckDryRun();

    /* No active mode → motor off + reset FSM */
    if (!isAnyModeActive())
    {
        stop_motor();
        dryState       = DRY_IDLE;
        dryConfirming  = false;
        dryDeadline    = 0;
        return;
    }

    /***********************************************************
     * 3) FSM OPERATION
     ***********************************************************/
    switch (dryState)
    {
    case DRY_IDLE:
        if (senseDryRun)  // water present
        {
            start_motor();
            dryState = DRY_NORMAL;
        }
        else              // dry
        {
            if (now >= dryDeadline)
            {
                start_motor();
                dryState = DRY_PROBE;
                dryDeadline = now + DRY_PROBE_ON_MS;
            }
        }
        break;

    case DRY_PROBE:
        if (senseDryRun)   // water found
        {
            dryState = DRY_NORMAL;
        }
        else if (now >= dryDeadline)
        {
            stop_motor();
            dryState = DRY_IDLE;
            dryDeadline = now + DRY_PROBE_OFF_MS;
        }
        break;

    case DRY_NORMAL:
        if (!senseDryRun)   // DRY detected
        {
            if (!dryConfirming)
            {
                dryConfirming = true;
                dryConfirmStart = now;
            }
            else if (now - dryConfirmStart >= DRY_CONFIRM_MS)
            {
                stop_motor();
                dryState = DRY_IDLE;
                dryConfirming = false;
                dryDeadline = now + DRY_PROBE_OFF_MS;
            }
        }
        else
        {
            dryConfirming = false;
        }
        break;
    }
}

/***************************************************************
 *  LEGACY ENTRY POINT
 ***************************************************************/
void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}

/***************************************************************
 * ======================== TIMER MODE =========================
 *  DS1307 dow: 1=Mon … 7=Sun
 *  dayMask: bit0=Mon … bit6=Sun
 ***************************************************************/

/* Convert RTC DOW into mask bit */
static inline uint8_t get_today_mask(void)
{
    uint8_t dow = time.dow;       // DS1307: 1..7
    if (dow < 1 || dow > 7)
        dow = 1;
    return (1u << (dow - 1));     // Mon=bit0 ... Sun=bit6
}

/* Check if slot should run now (enabled + day + time window) */
static bool timer_slot_should_run(const TimerSlot *t)
{
    if (!t->enabled)
        return false;

    /* Day check */
    uint8_t maskToday = get_today_mask();
    if ((t->dayMask & maskToday) == 0)
        return false;

    /* Time-of-day check */
    uint32_t nowS = (uint32_t)time.hour * 3600UL + (uint32_t)time.min * 60UL;

    uint32_t onS  = ((uint32_t)t->onHour  * 3600UL) + (t->onMinute  * 60UL);
    uint32_t offS = ((uint32_t)t->offHour * 3600UL) + (t->offMinute * 60UL);

    /* Normal window (on < off) */
    if (onS < offS)
        return (nowS >= onS && nowS < offS);

    /* Overnight window (on > off) */
    return (nowS >= onS || nowS < offS);
}

/* Check if ANY slot is active */
static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
    {
        if (timer_slot_should_run(&timerSlots[i]))
            return true;
    }
    return false;
}
static bool slot_is_active_now(TimerSlot *t)
{
    if (!t->enabled)
        return false;

    uint8_t today = time.dow;     // 1=Mon ... 7=Sun
    uint8_t mask = (1 << (today - 1));

    if (!(t->dayMask & mask))
        return false;

    uint32_t now = time.hour * 3600 + time.min * 60;
    uint32_t on  = t->onHour  * 3600 + t->onMinute  * 60;
    uint32_t off = t->offHour * 3600 + t->offMinute * 60;

    if (on < off)
        return (now >= on && now < off);

    // OVERNIGHT SLOT (ex: 22:00 → 06:00)
    return (now >= on || now < off);
}

/***************************************************************
 *  Start nearest timer slot (from UI SW3 short press)
 ***************************************************************/
void ModelHandle_StartTimerNearestSlot(void)
{
    clear_all_modes();
    timerActive = true;

    /* Force latest RTC time */
    RTC_GetTimeDate();

    uint32_t nowS = time.hour * 3600UL + time.min * 60UL;

    int best = -1;
    uint32_t bestDiff = 86400UL;

    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];

        if (!t->enabled)
            continue;

        uint8_t maskToday = get_today_mask();
        if ((t->dayMask & maskToday) == 0)
            continue;

        uint32_t onS = t->onHour * 3600UL + t->onMinute * 60UL;

        uint32_t diff = (onS >= nowS)
                      ? (onS - nowS)
                      : (86400UL - (nowS - onS));

        if (diff < bestDiff)
        {
            bestDiff = diff;
            best = i;
        }
    }

    /* If we found a valid slot → recalc normally */
    if (best >= 0)
    {
        ModelHandle_TimerRecalculateNow();
    }
    else
    {
        /* No slot today → motor must remain OFF */
        stop_motor();
    }
}
void ModelHandle_ProcessTimerSlots(void)
{
    if (!timerActive)
        return;

    bool active = false;

    for (int i = 0; i < 5; i++)
    {
        if (slot_is_active_now(&timerSlots[i]))
        {
            active = true;
            break;
        }
    }

    if (active)
    {
        // IGNORE DRY RUN IN TIMER MODE (your requirement)
        senseDryRun = true;

        start_motor();
    }
    else
    {
        stop_motor();
    }
}

/***************************************************************
 *  Force timer evaluation (called after editing slots)
 ***************************************************************/
void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive)
        return;

    bool active = timer_any_active_slot();

    if (active)
    {
        start_motor();
        ModelHandle_CheckDryRun();

        if (senseDryRun)
            stop_motor();   // water needed but dry
    }
    else
    {
        stop_motor();
    }
}

/***************************************************************
 *  Start/Stop Timer Mode
 ***************************************************************/
void ModelHandle_StartTimer(void)
{
    clear_all_modes();
    timerActive = true;

    bool active = timer_any_active_slot();

    if (active)
    {
        start_motor();
        ModelHandle_CheckDryRun();

        if (senseDryRun)
            stop_motor();
    }
    else
    {
        stop_motor();
    }
}

